In [2]:
import numpy as np 
import pandas as pd

In [3]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df = pd.DataFrame(data)

In [4]:
data_list = [
    ['John','28','New York', '65000'],
    ['Anna','34','Paris','70000'],
    ['Peter','29','Berlin','62000'],
    ['Linda','42','London','85000']
]

df2 = pd.DataFrame(data_list)
columns = ["Name","Age","City","Salary"]
df2 = pd.DataFrame(data_list,columns = columns)
df2

    Name Age      City Salary
0   John  28  New York  65000
1   Anna  34     Paris  70000
2  Peter  29    Berlin  62000
3  Linda  42    London  85000

In [5]:
df2[['Name','City']]

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

In [6]:
df2["nice"] = ['Gardening','Reading','Playing','Riding']
df2

    Name Age      City Salary       nice
0   John  28  New York  65000  Gardening
1   Anna  34     Paris  70000    Reading
2  Peter  29    Berlin  62000    Playing
3  Linda  42    London  85000     Riding

In [7]:
df2.drop('nice',axis = 1, inplace=True)

In [8]:
df2.drop(0)

    Name Age    City Salary
1   Anna  34   Paris  70000
2  Peter  29  Berlin  62000
3  Linda  42  London  85000

In [9]:
df2.loc[1]

Name       Anna
Age          34
City      Paris
Salary    70000
Name: 1, dtype: object

In [12]:
df2.loc[[0,1]]

   Name Age      City Salary
0  John  28  New York  65000
1  Anna  34     Paris  70000

In [13]:
df.iloc[3]

Name       Linda
Age           42
City      London
Salary     85000
Name: 3, dtype: object

In [15]:
df2.loc[[0,2]][["City","Salary"]]

       City Salary
0  New York  65000
2    Berlin  62000

In [16]:
df2.loc[[2,3]][["Name","Age"]]

    Name Age
2  Peter  29
3  Linda  42

In [22]:
df2["Age"] = pd.to_numeric(df2["Age"], errors="coerce")
df2[df2["Age"] > 30]

    Name  Age    City Salary
1   Anna   34   Paris  70000
3  Linda   42  London  85000

In [23]:
df2["Age"] = pd.to_numeric(df2["Age"], errors="coerce")
df2[(df2["Age"] > 30) & (df2["City"]=='Paris')]

   Name  Age   City Salary
1  Anna   34  Paris  70000